```aws_ssm_parameter.cache_port: Refreshing state... [id=cache_port]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00c5481cfcd1fcc90]
aws_lambda_layer_version.pymemcache_layer: Refreshing state... [id=arn:aws:lambda:us-east-1:605060434181:layer:pymemcache:1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f99f159c006c53b4]
aws_ssm_parameter.pymemcache_layer: Refreshing state... [id=pymemcache_layer]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0412d5aeeb42e4d59]
aws_security_group.allow_memcached: Refreshing state... [id=sg-07d88c1ebd6b4f2bd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-01f3eda1e9cc4e283]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-069d8a2342d30d093]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0193c7919d5cb8fcd]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f304f677a886d495]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fb8cc3e35a1c64d5]
aws_security_group.allow_lambdas: Refreshing state... [id=sg-09b65e38a4ea3bf88]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0c265220a6b794851]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-005d6aa840a09cd00]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0841e94502f1ad86d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0412d5aeeb42e4d591080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d9782eb37741b103]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-00c4f867e733370c2]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02a22ae984be33fa3]
aws_elasticache_subnet_group.memcached-subnets: Refreshing state... [id=memcached-subnets]
aws_ssm_parameter.lambda_subnets: Refreshing state... [id=private_subnets]
aws_security_group_rule.lambdas_out_memcached: Refreshing state... [id=sgrule-170257625]
aws_security_group_rule.memcached_in: Refreshing state... [id=sgrule-4265095306]
aws_ssm_parameter.lambdas_security_group: Refreshing state... [id=lambdas_security_group]
aws_security_group_rule.lambdas_out_fastly: Refreshing state... [id=sgrule-1266166852]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c61f711ef3cf22d4]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b47ac0e1657247b0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d8bc613fd00bff75]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08fcd064c910c9b20]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-01f3eda1e9cc4e2831080289494]
aws_elasticache_cluster.this: Refreshing state... [id=cluster-ffl]
aws_ssm_parameter.cache_endpoint: Refreshing state... [id=cache_endpoint]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_security_group_rule.lambdas_out_memcached has changed
  ~ resource "aws_security_group_rule" "lambdas_out_memcached" {
      + cidr_blocks              = []
        id                       = "sgrule-170257625"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.lambdas_security_group has changed
  ~ resource "aws_ssm_parameter" "lambdas_security_group" {
        id        = "lambdas_security_group"
        name      = "lambdas_security_group"
      + tags      = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_elasticache_cluster.this will be updated in-place
  ~ resource "aws_elasticache_cluster" "this" {
        id                       = "cluster-ffl"
      ~ security_group_ids       = [
          - "sg-07d88c1ebd6b4f2bd",
        ] -> (known after apply)
        tags                     = {}
        # (19 unchanged attributes hidden)
    }

  # aws_security_group.allow_lambdas must be replaced
-/+ resource "aws_security_group" "allow_lambdas" {
      ~ arn                    = "arn:aws:ec2:us-east-1:605060434181:security-group/sg-09b65e38a4ea3bf88" -> (known after apply)
      ~ description            = "Allow lambda egress traffic to Memcached" -> "Allow lambda traffic" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "23.235.32.0/20",
                  - "43.249.72.0/22",
                  - "103.244.50.0/24",
                  - "103.245.222.0/23",
                  - "103.245.224.0/24",
                  - "104.156.80.0/20",
                  - "140.248.64.0/18",
                  - "140.248.128.0/17",
                  - "146.75.0.0/17",
                  - "151.101.0.0/16",
                  - "157.52.64.0/18",
                  - "167.82.0.0/17",
                  - "167.82.128.0/20",
                  - "167.82.160.0/20",
                  - "167.82.224.0/20",
                  - "172.111.64.0/18",
                  - "185.31.16.0/22",
                  - "199.27.72.0/21",
                  - "199.232.0.0/16",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 11211
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07d88c1ebd6b4f2bd",
                ]
              - self             = false
              - to_port          = 11211
            },
        ] -> (known after apply)
      ~ id                     = "sg-09b65e38a4ea3bf88" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
        name                   = "allow_lambda"
      + name_prefix            = (known after apply)
      ~ owner_id               = "605060434181" -> (known after apply)
        tags                   = {
            "Name" = "allow_lambdas"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.allow_memcached must be replaced
-/+ resource "aws_security_group" "allow_memcached" {
      ~ arn                    = "arn:aws:ec2:us-east-1:605060434181:security-group/sg-07d88c1ebd6b4f2bd" -> (known after apply)
      ~ description            = "Allow memcached inbound traffic" -> "Allow memcached traffic" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-07d88c1ebd6b4f2bd" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 11211
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09b65e38a4ea3bf88",
                ]
              - self             = false
              - to_port          = 11211
            },
        ] -> (known after apply)
        name                   = "allow_memcached"
      + name_prefix            = (known after apply)
      ~ owner_id               = "605060434181" -> (known after apply)
        tags                   = {
            "Name" = "allow_memcached"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group_rule.lambdas_out_fastly must be replaced
-/+ resource "aws_security_group_rule" "lambdas_out_fastly" {
      + description              = "Allow fastly outboud traffic"
      ~ id                       = "sgrule-1266166852" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-09b65e38a4ea3bf88" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.lambdas_out_memcached must be replaced
-/+ resource "aws_security_group_rule" "lambdas_out_memcached" {
      - cidr_blocks              = [] -> null
      + description              = "Allow memcached outboud traffic"
      ~ id                       = "sgrule-170257625" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-09b65e38a4ea3bf88" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-07d88c1ebd6b4f2bd" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_security_group_rule.memcached_in must be replaced
-/+ resource "aws_security_group_rule" "memcached_in" {
      - cidr_blocks              = [] -> null
      + description              = "Allow lambda inbound traffic"
      ~ id                       = "sgrule-4265095306" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-07d88c1ebd6b4f2bd" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-09b65e38a4ea3bf88" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_ssm_parameter.lambdas_security_group will be updated in-place
  ~ resource "aws_ssm_parameter" "lambdas_security_group" {
        id        = "lambdas_security_group"
        name      = "lambdas_security_group"
        tags      = {}
      ~ value     = (sensitive value)
      ~ version   = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```